KanatERPSukhova.КанатАдаптация/src/Catalogs/ЭтапыПроизводства/ЭтапыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8a5439d8-cc0d-400e-9c24-345aa84acb85">
  <name>ЭтапыПроизводства</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_ПоказателиОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ЭтапыПроизводства/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24++
	СтраницаЗаправочныеПараметры = Элементы.Добавить("КАНАТ_СтраницаЗаправочныеПараметры",
												Тип("ГруппаФормы"),
												Элементы.Страницы);
	СтраницаЗаправочныеПараметры.Вид = ВидГруппыФормы.Страница;
	СтраницаЗаправочныеПараметры.Заголовок = "Заправочные параметры";
	
	ЭлементОборудование = Элементы.Добавить("КАНАТ_ЭлементОборудование",
													 Тип("ПолеФормы"),
													 СтраницаЗаправочныеПараметры);
	ЭлементОборудование.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементОборудование.ПутьКДанным = "Объект.КАНАТ_Оборудование";
	
	ТаблицаПоказатели = Элементы.Добавить("КАНАТ_ТаблицаПоказатели", Тип("ТаблицаФормы"),СтраницаЗаправочныеПараметры);
	ТаблицаПоказатели.ПутьКДанным = "Объект.КАНАТ_Показатели";
	
	ТаблицаПоказателиПоказатель  = Элементы.Добавить("КАНАТ_ТаблицаПоказателиПоказатель",
														   Тип("ПолеФормы"),
														   ТаблицаПоказатели);
	ТаблицаПоказателиПоказатель.Вид = ВидПоляФормы.ПолеВвода;      
	ТаблицаПоказателиПоказатель.ПутьКДанным = "Объект.КАНАТ_Показатели.Показатель";
	
	ТаблицаПоказателиЗначение  = Элементы.Добавить("КАНАТ_ТаблицаПоказателиЗначение",
														   Тип("ПолеФормы"),
														   ТаблицаПоказатели);
	ТаблицаПоказателиЗначение.Вид = ВидПоляФормы.ПолеВвода;      
	ТаблицаПоказателиЗначение.ПутьКДанным = "Объект.КАНАТ_Показатели.Значение";
	
	ЭлементЗапПараметры = Элементы.Добавить("КАНАТ_ЭлементЗаправочныеПараметры",
													 Тип("ПолеФормы"),
													 СтраницаЗаправочныеПараметры);
	ЭлементЗапПараметры.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементЗапПараметры.ПутьКДанным = "Объект.КАНАТ_ЗаправочныеПараметры"; 
	ЭлементЗапПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементЗапПараметры.АвтоМаксимальнаяШирина = Ложь;
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24--
КонецПроцедуры
